#include "stdafx.h"

void MyGame::Play()
{
	while (Update()) // 注意！！
	{
		// -----------------------------------------------
		// ---------キー入力------------------------------
		// -----------------------------------------------
		if (KeySpace.down())
		{
			ChangeScene(&MyGame::Title);
		}
		// -----------------------------------------------
		// ---------画像表示------------------------------
		// -----------------------------------------------
		texture.draw(200, 200);
		// テキストを画面の中心に描く | Put a text in the middle of the screen
		// -----------------------------------------------
		// ---------文字表示------------------------------
		// -----------------------------------------------
		font60(U"Play画面").drawAt(Scene::Center(), Palette::Black);

		font30(U"Push Space Key ").draw(0,0,Palette::Black);
		// マウスカーソルに追随する半透明な★を描く
		Shape2D::Star(100 + Periodic::Sine0_1(1s) * 40, Cursor::Pos()).draw(ColorF{ 0, 1, 1, 0.5 });
	}
}
